#+TITLE: Exercise 2: Expresions,Variables,Assignments
#+AUTHOR: PRAVEEN KUMAR R
#+DATE: 5/2/18

#+LaTex_HEADER: \usepackage{palatino}
#+LaTex_HEADER: \usepackage[top=1in,bottom=1.25in,left=1.25in,right=1.25in]{geometry}
#+LaTex_HEADER: \usepackage{setspace}
#+OPTIONS: toc:nil
#+OPTIONS: num:1
#+STARTUP: showeverything

#+BEGIN_EXPORT latex
\linespread{1.2}
#+END_EXPORT
#+PROPERTY: header-args :exports both

| Assignment |               1 |
| Reg No     |    312217104114 |
| Name       | PRAVEEN KUMAR R |
| Grade      |                 |
| Date       |      19-02-2018 |


** Program
     #+BEGIN_SRC C :cmdline <ex02_1.input

       #include<stdio.h>
       /*
         input: r of type float
         output: a value of type float calculated as pi*r*r.

       ,*/
       float area(float r)
       {
         return 3.14*r*r;
       }
       /*
         input: r of type float
         output: a value of type float calculated as 2* pi*r
       ,*/
       float perimeter(float r)
       {
         return 2*3.14*r;
       }
       int main()
       {
         float r,ar,p;
         scanf("%f",&r);
         ar=area(r);
         p=perimeter(r);
         printf("radius=%4.2f\t area=%4.2f\t perimeter=%4.2f\t",r,ar,p);
         return 0;
       }

     #+END_SRC

     #+RESULTS:
     | radius=40.00 | area=5024.00 | perimeter=251.20 |

** Program
   #+BEGIN_SRC C :cmdline <input2_4.in
       #include <stdio.h>

       int main ()
       {
         int a;
         int b;

         scanf ("%d%d", &a, &b);
         printf ("a = %d, b = %d\n", a, b);
         int t = a;
         a = b;
         b = t;
         printf ("a = %d, b = %d\n", a, b);  
         return 0;
       }
    #+END_SRC

    #+RESULTS:
     | a = 1  | b = -3 |
     | a = -3 | b = 1  |

** Program
     #+BEGIN_SRC C :cmdline <input2_4.in
       #include <stdio.h>

       int main ()
       {
         int a, b, c, d,t;
         
         scanf ("%d%d%d%d", &a, &b, &c, &d);
         printf ("a = %d, b = %d, c = %d, d = %d\n", a, b, c, d);
         t = a;
         a = b;
         b = c;
         c = d;
         d = t;
         printf ("a = %d, b = %d, c = %d, d = %d\n", a, b, c, d);
         return 0;
       }     
     #+END_SRC

     #+RESULTS:
     | a = 1  | b = -3 | c = 2 | d = 6 |
     | a = -3 | b = 2  | c = 6 | d = 1 |

** Program
    #+BEGIN_SRC C :cmdline <
      #include<stdio.h>
      int min2(int a,int b)
      {
         if(a<=b)
             return a;
         else
             return b;
      }
      int min3(int a, int b, int c)
      {
         int temp;
         temp=min2(a,b);
         return min2(temp,c);
      }
      int main()
      {
         int a,b,c,s,t,u;
         scanf("%d%d%d",&a,&b,&c);
         printf("a=%d, b=%d, c=%d\n",a,b,c);
         t=min3(a,b,c);
         if (t==a)
         {
             s=min2(b,c);
             if (s==b)
	        u=c;
             else
                u=b;
         }
         else if (t==b)
              {
                  s=min2(a,c);
                  if(s==a)
	             u=c;
                  else u=a;
              } 
              else
              {
                  s=min2(a,b);
                  if(s==a)
	             u=b;
                  else
                     u=a;
              }
         a=t;
         b=s;
         c=u;
         printf("a=%d, b=%d, c=%d",a,b,c);
      }
    #+END_SRC

     #+RESULTS:
     | a = 1  | b = -3 | c = 2 |
     | a = -3 | b = 1  | c = 2 |

** Program
   #+BEGIN_SRC C :cmdline <
      #include<stdio.h>
      int min2(int a,int b)
      {
         if(a<=b)
            return a;
         else
            return b;
      }
      int min3(int a, int b, int c)
      {
         int temp;
         temp=min2(a,b);
         return min2(temp,c);
      }
      int main()
      {
         int a[5],s,t,u,i;
         for (i=0;i<3;i++)
         {
            scanf("%d",&a[i]);
            printf("a[%d]=%d",i,a[i]);
            if (i==2) 
                printf("\n");
            else
                printf(", ");
         }  
         t=min3(a[0],a[1],a[2]);
         if (t==a[0])
         {
             s=min2(a[1],a[2]);
             if (s==a[1])
	        u=a[2];
             else u=a[1];
         }
         else if (t==a[1])
              {
                 s=min2(a[0],a[2]);
                 if(s==a[0])
	            u=a[2];
                 else u=a[0];
              }
              else
              { 
                 s=min2(a[0],a[1]);
                 if(s==a[0])
	            u=a[1];
                 else u=a[0];
              }
         a[0]=t;
         a[1]=s;
         a[2]=u;
         printf("a[0]=%d, a[1]=%d, a[2]=%d",a[0],a[1],a[2]);
       }
     
    #+END_SRC

    #+RESULTS:
    | a[0] = 1  | a[1] = -3 | a[2] = 2 |
    | a[0] = -3 | a[1] = 1  | a[2] = 2 |
     
* COMMENT Extra programs 
  10. Fill an array of size 3 with numbers read from stdin. Write a
      program to find the position (index), say =mpos=, of the smallest
      number in the array. Define a function a[0] $\le$ a[1] $\le$ a[2].
 
      #+BEGIN_SRC C :var c=5 :var d=10
      printf ("%d,%d\n", c, d);
      int t = c;
      c = d;
      d = t;
      printf ("%d,%d\n", c, d);
      #+END_SRC

      #+RESULTS:
      |  5 | 10 |
      | 10 |  5 |






